# Subscription Based Delivery (SBD) system

## Purpose: 
 - Base on customer shopping behaviors for groceries, GHB (general items, health or beauty items), or pet food to determine target/preferred customer
 - Pick up 10 items to deliver to target/preferred customer
   - 5 from most frequently bought items 
   - 5 from recommended engine
   
## This module includes the following steps:
 1. Initialization : Import packages/libraries and set up Teradata connection
 2. Inner join temp_tables.sbd_hhsk and temp_tables.rs_s0025_junaug19_knnb_cosine_meannrm to get 5 recommended items for target customer
 3. Create a Surprise dataset from temp_tables.rs_pos_tnx_s0025_junaug19_sum and pick up 5 from most frequently bought items 
 4. Created delivered items by combing items and step 2 and 3
 5. Load the delivered items into a table

## Input table: 
 A. temp_tables.rs_pos_tnx_s0025_junaug19_sum
    - A table created from Teradata SQL Assistance
      - Please refer to rs_user_base.ipynb for the selection criteria
 B. temp_tables.rs_s0025_junaug19_knnb_cosine_meannrm 
    - A table created from recommended engine
      - Applied KNNBasic, cosine similarity matrix and used  the mean of prod unit_qty to do the normalization 
      - Columns
        - hh_sk, prod_1, scr_1, prod_2, scr_2, ......knbr_1, scrs_1, ....
          - With 10 recommended items and top 10 most similar users
    - Please refer to rs_user_base.ipynb for the  details      
 C. temp_tables.sbd_hhsk
 - SBD criteria to determine hh_sk and build sbd_hhsk table:
   1. Create a table sbd_gro_hhsk to select hh_sk which had been shopping groceries 4 time for 3 months
     - prod_sk from dw_bi_vw.dim_2_prod where  corp_dept_nbr  = 307 or 
     (corp_dept_nbr = 301  and grp_id <> 32)
     - There are 3758 HH_SK meet the criteria
   2. Create a table sbd_ghb_hhsk to select hh_sk which had been shopping general items, health or beauty items 1 time for 3 months
      - prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 311
      - There are 2470 HH_SK meet the criteria
   3. Create a table sbd_pet_hhsk to select hh_sk which had been shopping at least one pet food items  in a quarter for 3 quarters   
      - prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 301 and grp_id = 32 
      - There are 782 HH_SK meet the criteria
   4. Inner join sbd_gro_hhsk, sbd_ghb_hhsk, sbd_pet_hhsk to select hh_sk meet 3 criteria 
   5. Use the following conditions for the testing
      - str_fac_nbr = 0025 
      - Timeframe 
        - m1 = 2019-06-01 ~ 2019-06-30 
        - m2 = 2019-07-01 ~ 2019-07-31
        - m3 = 2019-08-01 ~ 2019-08-31 
        - q1 = 2018-12-01 ~ 2019-02-28
        - q2 = 2019-03-01 ~ 2019-05-31
        - q3 = 2019-06-01 ~ 2019-08-31
    6. There are 339 HH_SK been selected for SBD test    
 
 ## Output table    
     - temp_tables.sbd_rs_comb
       - 10 delivered items by combing 5 from most frequently bought items and 5 recommended items
             
 ## Module name: sbd_rs_comb.ipynb      
  - Author: Sophia Yue
  - Date  : Oct 2019

## Step1 : Initialization 
 - Python compile() function is used to compile the source into code object or AST module object. 
 - The returned code object can be executed using exec()
 - Use compile function to execute the following codes which might be used by other modules 
   - c_import.py        : Import packages/libraries 
   - c_setup_dbs_con.py : Set up Teradata connection
   - c_time_dte.py      : Calculate elapsed time 
   - c_nbrK_list.py     : Create a list of KNeighbor

In [1]:
prg_name = ""
path_code = "C:\\Users\\syue003\\wip_RecSys\\"
c_import  = path_code + "c_import.py"
c_setup_dbs_con = path_code + "c_setup_dbs_con.py"
c_timedte = path_code + "c_time_dte.py" 

exec(compile(open(c_import, 'rb').read(), c_import,  'exec'))
exec(compile(open(c_setup_dbs_con, 'rb').read(),c_setup_dbs_con, 'exec'))
exec(compile(open(c_timedte, 'rb').read(),c_timedte, 'exec'))
session, td_enginex = cf_setup_dbs_con(userName = 'syue003', passWord = 'Chungli#1')
c_nbrK_list = path_code + "c_nbrK_list.py" 
exec(compile(open(c_nbrK_list, 'rb').read(), c_nbrK_list,  'exec'))

t_engine teradata://syue003:Chungli#1@tqdpr02/temp_tables

## Step2 : Join temp_tables.sbd_hhsk and temp_tables.rs_s0025_junaug19_knnb_cosine_meannrm to get top 5 recommended items

In [2]:
rs_tbl_name = "temp_tables.rs_s0025_junaug19_knnb_cosine_meannrm" 
sbd_tbl_name = "temp_tables.sbd_hhsk" 
query = """
    sel  sbd.hh_sk, prod_1,  prod_2, prod_3,  prod_4,  prod_5
     from {0} sbd
     inner join {1} rs
     on sbd.HH_SK = rs.HH_SK """.format(sbd_tbl_name, rs_tbl_name )
df_sbd_rs = pd.read_sql(query,session)

In [3]:
df_sbd_rs = df_sbd_rs.astype(np.int64) 
df_sbd_rs.head()

      HH_SK   prod_1   prod_2   prod_3   prod_4   prod_5
0   2987682   709038   345991  1366251  1085274   219118
1  60034781  1145662  2578235  1998226  2341633  1130337
2   4044599  1145662   592484   153712  2341633  2076820
3   3448421   625466   592484   622127   153712  1068396
4   4157968   301018  1272616  1516617   937782  1228795

## Step 3: Get the top K items we rated
   - Create a Surprise transit from temp_tables.rs_pos_tnx_s0025_junaug19_sum
   - Apply trainSet.ur to get all the items with non null unit_qty  
   - Apply heapq.nlargest to pick up 5 most frequent bought items 
   - Invoke cf_cr_nbrK_list to convert  a list of tuple from kNeighbors into a list 
     - Convert iid to row iid

In [4]:
tnx_tbl = "temp_tables.rs_pos_tnx_s0025_junaug19_sum"
query = """
select HH_SK, PROD_SK, UNIT_QTY   
from {0}""".format(tnx_tbl)
df_sum_qty = pd.read_sql(query,session) 

#  Build surprise dataset    
maxScale = 10 
df_sum_qty.HH_SK = df_sum_qty.HH_SK.astype(np.int64) 
reader = Reader(rating_scale=(1, maxScale))  # Reader object; rating_scale is required 
s_tnx_data = Dataset.load_from_df(df_sum_qty[['HH_SK', 'PROD_SK', 'UNIT_QTY']], reader) # type:  surprise.dataset.DatasetAutoFolds

trainSet = s_tnx_data.build_full_trainset()

In [5]:
# prod_unit_qty is a list of tuple to contain all the internal prod_sk and unit_qty with unit_qty are not missing
# .e.g   [(650, 5), (319, 2) .....]  
# kNeighbors would be a list of prod_sk and top K unit_qty
# Contruct a list from kNeighbors with hh_sk, prod_sk, unit_qty

k = 5
l_hh_sk = df_sbd_rs.HH_SK.to_list()
nbrK_ary = []
for hh_sk in l_hh_sk: 
    ihh_sk = trainSet.to_inner_uid(hh_sk)
    prod_unit_qty = trainSet.ur[ihh_sk]
    kNeighbors = heapq.nlargest(k, prod_unit_qty, key=lambda prod_unit_qty: prod_unit_qty[1])
    nbrK = cf_cr_nbrK_list( ihh_sk, kNeighbors, raw_uid= False)
    nbrK_ary.append(nbrK)

In [18]:
kNeighbors # 2337 is the iid (internal prod_sk) and 1096882 from nbrK is the row iid (prod_sk); 14.0 is unit_qty

[(2337, 14.0), (18624, 11.0), (32313, 10.0), (31615, 9.0), (3629, 9.0)]

In [19]:
nbrK  #

[61246895,
 1096882.0,
 14.0,
 354822.0,
 11.0,
 1471661.0,
 10.0,
 2040597.0,
 9.0,
 508170.0,
 9.0]

In [6]:
df_sbd_prod = pd.DataFrame( nbrK_ary, columns = ['HH_SK', 'sbd_prod_1', 'sbd_uqty_1', 'sbd_prod_2', 'sbd_uqty_2',
            'sbd_prod_3', 'sbd_uqty_3','sbd_prod_4', 'sbd_uqty_4', 'sbd_prod_5', 'sbd_uqty_5'])

In [7]:
df_sbd_prod= df_sbd_prod.astype(np.int64)
df_sbd_prod.head()

,HH_SK,sbd_prod_1,sbd_uqty_1,sbd_prod_2,sbd_uqty_2,sbd_prod_3,sbd_uqty_3,sbd_prod_4,sbd_uqty_4,sbd_prod_5,sbd_uqty_5
0,2987682,1381288,11,949661,8,1416484,8,1017289,8,2250160,7
1,60034781,2085210,4,1266709,4,1239647,3,1491527,3,1001413,3
2,4044599,1628330,11,370907,10,1237289,10,123280,9,626626,9
3,3448421,1380044,9,1782380,8,847066,7,986508,7,66294,6
4,4157968,1322275,9,1340745,8,1728088,7,507363,7,1017289,7

## Merge two dataframes

In [8]:
 df_sbd_rs_x = pd.merge(df_sbd_prod, df_sbd_rs, how = 'left', on = ['HH_SK', 'HH_SK'])

In [9]:
df_sbd_prod.shape  # (339, 11)
df_sbd_rs.shape     # (339, 6)

(339, 6)

In [10]:
 df_sbd_rs_x.head()

,HH_SK,sbd_prod_1,sbd_uqty_1,sbd_prod_2,sbd_uqty_2,sbd_prod_3,sbd_uqty_3,sbd_prod_4,sbd_uqty_4,sbd_prod_5,sbd_uqty_5,prod_1,prod_2,prod_3,prod_4,prod_5
0,2987682,1381288,11,949661,8,1416484,8,1017289,8,2250160,7,709038,345991,1366251,1085274,219118
1,60034781,2085210,4,1266709,4,1239647,3,1491527,3,1001413,3,1145662,2578235,1998226,2341633,1130337
2,4044599,1628330,11,370907,10,1237289,10,123280,9,626626,9,1145662,592484,153712,2341633,2076820
3,3448421,1380044,9,1782380,8,847066,7,986508,7,66294,6,625466,592484,622127,153712,1068396
4,4157968,1322275,9,1340745,8,1728088,7,507363,7,1017289,7,301018,1272616,1516617,937782,1228795

In [11]:
# Build an array of list with Target cuntomer, frequent bought items and recommended items
ary_sbd_rs = []
for idx, row in df_sbd_rs_x.iterrows():
    hh_sk = row[0]
    rank = 0
    for i_sbd in range(k):
        j = i_sbd * 2 + 1
        prod_id = row[j]
        rank += 1
        ary_sbd_rs.append([hh_sk, prod_id, rank])
        
    for i_rs in range(k):
        j = i_rs + 11
        prod_id = row[j]
        rank += 1
        ary_sbd_rs.append([hh_sk, prod_id, rank])

In [12]:
ary_sbd_rs[0: 20]

[[2987682, 1381288, 1],
 [2987682, 949661, 2],
 [2987682, 1416484, 3],
 [2987682, 1017289, 4],
 [2987682, 2250160, 5],
 [2987682, 709038, 6],
 [2987682, 345991, 7],
 [2987682, 1366251, 8],
 [2987682, 1085274, 9],
 [2987682, 219118, 10],
 [60034781, 2085210, 1],
 [60034781, 1266709, 2],
 [60034781, 1239647, 3],
 [60034781, 1491527, 4],
 [60034781, 1001413, 5],
 [60034781, 1145662, 6],
 [60034781, 2578235, 7],
 [60034781, 1998226, 8],
 [60034781, 2341633, 9],
 [60034781, 1130337, 10]]

In [13]:
df_sbd_rs_comb= pd.DataFrame(ary_sbd_rs, columns=('HH_SK','PROD_SK', 'CMB_RANK')).astype(np.int64)
df_sbd_rs_comb.head()

     HH_SK  PROD_SK  CMB_RANK
0  2987682  1381288         1
1  2987682   949661         2
2  2987682  1416484         3
3  2987682  1017289         4
4  2987682  2250160         5

## Load the df into a table

In [14]:
    fnc_name = 'Load table'
    start_time = time.time()
    tbl_nm = "sbd_rs_comb"
    
    df_sbd_rs_comb.to_sql(con=td_enginex, name=tbl_nm, if_exists='replace', index = False)
    end_time = time.time()
    cf_elapse_time (  start_time, end_time, "Function {0} to load table {1} completed.".format(fnc_name, tbl_nm))

 Function Load table to load table sbd_rs_comb completed. It took 132.388743 seconds - 0hh:2mm:12ss.
 start time: Oct 21 2019 23:08:19  end time:  Oct 21 2019 23:10:32

In [16]:
dim_tbl = "dw_bi_vw.DIM_2_PROD"
sbd_tbl = "temp_tables.sbd_rs_comb"
query="""
sel sbd.*, prod_dsc from  {0} sbd
inner join {1}  dim 
on sbd. prod_sk = dim.prod_sk 
order by   HH_SK, cmb_rank
""".format(sbd_tbl, dim_tbl)
df_sbd_rs_prod_dsc = pd.read_sql(query, session)

In [17]:
df_sbd_rs_prod_dsc.head(20)

        HH_SK    PROD_SK  CMB_RANK                                  PROD_DSC
0    825956.0   120477.0       1.0   BLUE BUNNY ICE CRM SNDWCH SWEET FREEDOM
1    825956.0  1995413.0       2.0   POPSICLE ORANGE CHERRY GRAPE SUGAR FREE
2    825956.0   722282.0       3.0   HANSENS DIET TANGERINE LIME FRIDGE PACK
3    825956.0    13262.0       4.0           SMOKEHOUSE POTATO SWEET CHICKEN
4    825956.0  2238912.0       5.0         R STOVER PEG BAG SGR FREE COCONUT
5    825956.0   622127.0       6.0                                 PARTY ICE
6    825956.0  1068396.0       7.0        REDUCED FOR QUICK SALE BAKERY 2.99
7    825956.0   632059.0       8.0                               GARLIC BULK
8    825956.0  1290148.0       9.0   REDUCED FOR QUICK SALE BAKERY .99 CENTS
9    825956.0  1127635.0      10.0                  OROWEAT MULTIGRAIN BREAD
10  1028070.0   231379.0       1.0                            LAYS DILL PCKL
11  1028070.0   990262.0       2.0                                 CUCUMBERS
12  1028070.0    37761.0       3.0  S SEL/KTCHNS POTATO CRINKLE CUT FRCH FRY
13  1028070.0  1330508.0       4.0                      SNICKERS ICE CRM BAR
14  1028070.0   770065.0       5.0              BUBLY SPARKLING WATER CHERRY
15  1028070.0   622127.0       6.0                                 PARTY ICE
16  1028070.0   592484.0       7.0                  SC SALAD ASIAN W/CHICKEN
17  1028070.0   625466.0       8.0                     LUCERNE EGGS LARGE AA
18  1028070.0  2063118.0       9.0                  WATERMELON PERSONAL/MINI
19  1028070.0   153712.0      10.0             ALMOND BREEZE CREAMER VANILLA

## Appendix1 - SQL to create grocery table (total count = 3758)
    create table temp_tables.sbd_gro_hhsk as
    (sel m3.hh_sk from
           ( sel  hh_sk  
             from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
             and prod_sk > 0 and hh_sk > 0   and unit_qty > 0 
             and txn_dt    between '2019-08-01' and  '2019-08-31'
             and prod_sk in  ( sel prod_sk from dw_bi_vw.dim_2_prod where  corp_dept_nbr  = 307 
             or (corp_dept_nbr = 301  and grp_id <> 32) )
    		  group by hh_sk having count(*) > 3 
             ) as m3
    		 inner join 
    	     ( sel   hh_sk  
               from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
               and prod_sk > 0 and hh_sk > 0   and unit_qty > 0 
               and txn_dt    between '2019-07-01' and  '2019-07-31'
               and prod_sk in  ( sel prod_sk from dw_bi_vw.dim_2_prod where  corp_dept_nbr  = 307 
               or (corp_dept_nbr = 301  and grp_id <> 32) )
    		   group by hh_sk having count(*) > 3  ) as m2
    	  on m3.hh_sk = m2.hh_sk
    	  inner join 
    	     ( sel   hh_sk  
               from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
               and prod_sk > 0 and hh_sk > 0   and unit_qty > 0 
               and txn_dt    between '2019-06-01' and  '2019-06-30'
               and prod_sk in  ( sel prod_sk from dw_bi_vw.dim_2_prod where  corp_dept_nbr  = 307 
               or (corp_dept_nbr = 301  and grp_id <> 32) )
    		   group by hh_sk having count(*) > 3  ) as m1
    	  on m3.hh_sk = m1.hh_sk
              group by m3.hh_sk	 ) with data;

## Appendix2 - SQL to create GHB (general, health or beauty items) table (total count = 2470)
 
    create table temp_tables.sbd_ghb_hhsk as
    (sel m3.hh_sk from
       ( sel  hh_sk  
         from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
         and prod_sk > 0 and hh_sk > 0   and unit_qty > 0 
         and txn_dt    between '2019-08-01' and  '2019-08-31'
		 and prod_sk in   (sel prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 311) 
		 group by hh_sk
		 ) as m3
     inner join 
	     ( sel   hh_sk  
           from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
           and prod_sk > 0 and hh_sk > 0   and unit_qty > 0 
           and txn_dt    between '2019-07-01' and  '2019-07-31'
           and prod_sk in   (sel prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 311) 
		   group by hh_sk
		   ) as m2
	  on m3.hh_sk = m2.hh_sk
	  inner join 
	     ( sel   hh_sk  
           from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
           and prod_sk > 0 and hh_sk > 0   and unit_qty > 0 
           and txn_dt    between '2019-06-01' and  '2019-06-30'
           and prod_sk in   (sel prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 311) 
		   group by hh_sk
		   ) as m1	  
		 on  m3.hh_sk = m1.hh_sk
		 group by m3.hh_sk
 ) with data;

## Appendix3 - SQL to a create pet table (total count = 782)
    create table temp_tables.sbd_pet_hhsk as
    (sel q1.hh_sk from
          ( sel  hh_sk 
            from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
             and prod_sk > 0 and hh_sk > 0 
             and unit_qty > 0 
             and txn_dt    between '2018-12-01' and  '2019-02-28'
             and prod_sk in 
             (sel prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 301 and grp_id = 32) 
             group by hh_sk
            ) as q1
     
     inner join
           ( sel  hh_sk 
            from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
           and prod_sk > 0 and hh_sk > 0 
           and unit_qty > 0 
           and txn_dt    between '2019-03-01' and  '2019-05-31'
           and prod_sk in 
           (sel prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 301 and grp_id = 32) 
           group by hh_sk
          ) as q2
       on q1.hh_sk = q2.hh_sk
          
      inner join 
          ( sel  hh_sk 
          from dw_bi_vw.F_POS_TXN_DTL where STR_FAC_NBR  = 0025 and WGT_PROD_IND = 0 
           and prod_sk > 0 and hh_sk > 0 
           and unit_qty > 0 
           and txn_dt    between '2019-06-01' and  '2019-08-31'
          and prod_sk in 
         (sel prod_sk from dw_bi_vw.dim_2_prod where corp_dept_nbr = 301 and grp_id = 32) 
         group by hh_sk
        ) as q3
    on q1.hh_sk = q3.hh_sk
    group by q1.hh_sk) with data

## Appendix3 - SQL to create a table with common HH_SK form 3 tables above  (total count = 339)
   create table temp_tables.sbd_hhsk as
   (sel pet.hh_sk 
    from  temp_tables.sbd_pet_hhsk  pet
    inner join  temp_tables.sbd_ghb_hhsk  ghb
    on   pet.hh_sk = ghb.hh_sk
    inner join  temp_tables.sbd_gro_hhsk  gro
    on    pet.hh_sk = gro.hh_sk  
    group by   pet.hh_sk ) with data